feat: complex types, better error message
